Revit 2027 API
PreviewControl Properties
The PreviewControl type exposes the following members.
Properties
Name | Description
ActualHeight | Gets the rendered height of this element.
(Inherited from FrameworkElement)
ActualWidth | Gets the rendered width of this element.
(Inherited from FrameworkElement)
AllowDrop | Gets or sets a value indicating whether this element can be used as the target of a drag-and-drop operation. This is a dependency property.
(Inherited from UIElement)
AreAnyTouchesCaptured | Gets a value that indicates whether at least one touch is captured to this element.
(Inherited from UIElement)
AreAnyTouchesCapturedWithin | Gets a value that indicates whether at least one touch is captured to this element or to any child elements in its visual tree.
(Inherited from UIElement)
AreAnyTouchesDirectlyOver | Gets a value that indicates whether at least one touch is pressed over this element.
(Inherited from UIElement)
AreAnyTouchesOver | Gets a value that indicates whether at least one touch is pressed over this element or any child elements in its visual tree.
(Inherited from UIElement)
Background | Gets or sets a brush that describes the background of a control.
(Inherited from Control)
BindingGroup | Gets or sets the BindingGroup that is used for the element.
(Inherited from FrameworkElement)
BitmapEffect | Obsolete.
Gets or sets a bitmap effect that applies directly to the rendered content for this element. This is a dependency property.
(Inherited from UIElement)
BitmapEffectInput | Obsolete.
Gets or sets an input source for the bitmap effect that applies directly to the rendered content for this element. This is a dependency property.
(Inherited from UIElement)
BorderBrush | Gets or sets a brush that describes the border background of a control.
(Inherited from Control)
BorderThickness | Gets or sets the border thickness of a control.
(Inherited from Control)
CacheMode | Gets or sets a cached representation of the UIElement.
(Inherited from UIElement)
Clip | Gets or sets the geometry used to define the outline of the contents of an element. This is a dependency property.
(Inherited from UIElement)
ClipToBounds | Gets or sets a value indicating whether to clip the content of this element (or content coming from the child elements of this element) to fit into the size of the containing element. This is a dependency property.
(Inherited from UIElement)
CommandBindings | Gets a collection of CommandBinding objects associated with this element. A CommandBinding enables command handling for this element, and declares the linkage between a command, its events, and the handlers attached by this element.
(Inherited from UIElement)
Content | Gets or sets the content of a ContentControl.
(Inherited from ContentControl)
ContentStringFormat | Gets or sets a composite string that specifies how to format the Content property if it is displayed as a string.
(Inherited from ContentControl)
ContentTemplate | Gets or sets the data template used to display the content of the ContentControl.
(Inherited from ContentControl)
ContentTemplateSelector | Gets or sets a template selector that enables an application writer to provide custom template-selection logic.
(Inherited from ContentControl)
ContextMenu | Gets or sets the context menu element that should appear whenever the context menu is requested through user interface (UI) from within this element.
(Inherited from FrameworkElement)
Cursor | Gets or sets the cursor that displays when the mouse pointer is over this element.
(Inherited from FrameworkElement)
DataContext | Gets or sets the data context for an element when it participates in data binding.
(Inherited from FrameworkElement)
DependencyObjectType | Gets the DependencyObjectType that wraps the CLR type of this instance.
(Inherited from DependencyObject)
DesiredSize | Gets the size that this element computed during the measure pass of the layout process.
(Inherited from UIElement)
Dispatcher | Gets the Dispatcher this DispatcherObject is associated with.
(Inherited from DispatcherObject)
Effect | Gets or sets the bitmap effect to apply to the UIElement. This is a dependency property.
(Inherited from UIElement)
FlowDirection | Gets or sets the direction that text and other user interface (UI) elements flow within any parent element that controls their layout.
(Inherited from FrameworkElement)
Focusable | Gets or sets a value that indicates whether the element can receive focus. This is a dependency property.
(Inherited from UIElement)
FocusVisualStyle | Gets or sets a property that enables customization of appearance, effects, or other style characteristics that will apply to this element when it captures keyboard focus.
(Inherited from FrameworkElement)
FontFamily | Gets or sets the font family of the control.
(Inherited from Control)
FontSize | Gets or sets the font size.
(Inherited from Control)
FontStretch | Gets or sets the degree to which a font is condensed or expanded on the screen.
(Inherited from Control)
FontStyle | Gets or sets the font style.
(Inherited from Control)
FontWeight | Gets or sets the weight or thickness of the specified font.
(Inherited from Control)
ForceCursor | Gets or sets a value that indicates whether this FrameworkElement should force the user interface (UI) to render the cursor as declared by the Cursor property.
(Inherited from FrameworkElement)
Foreground | Gets or sets a brush that describes the foreground color.
(Inherited from Control)
HasAnimatedProperties | Gets a value indicating whether this element has any animated properties.
(Inherited from UIElement)
HasContent | Gets a value that indicates whether the ContentControl contains content.
(Inherited from ContentControl)
Height | Gets or sets the suggested height of the element.
(Inherited from FrameworkElement)
HorizontalAlignment | Gets or sets the horizontal alignment characteristics applied to this element when it is composed within a parent element, such as a panel or items control.
(Inherited from FrameworkElement)
HorizontalContentAlignment | Gets or sets the horizontal alignment of the control's content.
(Inherited from Control)
InputBindings | Gets the collection of input bindings associated with this element.
(Inherited from UIElement)
InputScope | Gets or sets the context for input used by this FrameworkElement.
(Inherited from FrameworkElement)
IsArrangeValid | Gets a value indicating whether the computed size and position of child elements in this element's layout are valid.
(Inherited from UIElement)
IsEnabled | Gets or sets a value indicating whether this element is enabled in the user interface (UI). This is a dependency property.
(Inherited from UIElement)
IsFocused | Gets a value that determines whether this element has logical focus. This is a dependency property.
(Inherited from UIElement)
IsHitTestVisible | Gets or sets a value that declares whether this element can possibly be returned as a hit test result from some portion of its rendered content. This is a dependency property.
(Inherited from UIElement)
IsInitialized | Gets a value that indicates whether this element has been initialized, either during processing by a XAML processor, or by explicitly having its EndInit() method called.
(Inherited from FrameworkElement)
IsInputMethodEnabled | Gets a value indicating whether an input method system, such as an Input Method Editor (IME), is enabled for processing the input to this element.
(Inherited from UIElement)
IsKeyboardFocused | Gets a value indicating whether this element has keyboard focus. This is a dependency property.
(Inherited from UIElement)
IsKeyboardFocusWithin | Gets a value indicating whether keyboard focus is anywhere within the element or its visual tree child elements. This is a dependency property.
(Inherited from UIElement)
IsLoaded | Gets a value that indicates whether this element has been loaded for presentation.
(Inherited from FrameworkElement)
IsManipulationEnabled | Gets or sets a value that indicates whether manipulation events are enabled on this UIElement.
(Inherited from UIElement)
IsMeasureValid | Gets a value indicating whether the current size returned by layout measure is valid.
(Inherited from UIElement)
IsMouseCaptured | Gets a value indicating whether the mouse is captured to this element. This is a dependency property.
(Inherited from UIElement)
IsMouseCaptureWithin | Gets a value that determines whether mouse capture is held by this element or by child elements in its visual tree. This is a dependency property.
(Inherited from UIElement)
IsMouseDirectlyOver | Gets a value that indicates whether the position of the mouse pointer corresponds to hit test results, which take element compositing into account. This is a dependency property.
(Inherited from UIElement)
IsMouseOver | Gets a value indicating whether the mouse pointer is located over this element (including child elements in the visual tree). This is a dependency property.
(Inherited from UIElement)
IsSealed | Gets a value that indicates whether this instance is currently sealed (read-only).
(Inherited from DependencyObject)
IsStylusCaptured | Gets a value indicating whether the stylus is captured by this element. This is a dependency property.
(Inherited from UIElement)
IsStylusCaptureWithin | Gets a value that determines whether stylus capture is held by this element, or an element within the element bounds and its visual tree. This is a dependency property.
(Inherited from UIElement)
IsStylusDirectlyOver | Gets a value that indicates whether the stylus position corresponds to hit test results, which take element compositing into account. This is a dependency property.
(Inherited from UIElement)
IsStylusOver | Gets a value indicating whether the stylus cursor is located over this element (including visual child elements). This is a dependency property.
(Inherited from UIElement)
IsTabStop | Gets or sets a value that indicates whether a control is included in tab navigation.
(Inherited from Control)
IsVisible | Gets a value indicating whether this element is visible in the user interface (UI). This is a dependency property.
(Inherited from UIElement)
Language | Gets or sets localization/globalization language information that applies to an element.
(Inherited from FrameworkElement)
LayoutTransform | Gets or sets a graphics transformation that should apply to this element when layout is performed.
(Inherited from FrameworkElement)
Margin | Gets or sets the outer margin of an element.
(Inherited from FrameworkElement)
MaxHeight | Gets or sets the maximum height constraint of the element.
(Inherited from FrameworkElement)
MaxWidth | Gets or sets the maximum width constraint of the element.
(Inherited from FrameworkElement)
MinHeight | Gets or sets the minimum height constraint of the element.
(Inherited from FrameworkElement)
MinWidth | Gets or sets the minimum width constraint of the element.
(Inherited from FrameworkElement)
Name | Gets or sets the identifying name of the element. The name provides a reference so that code-behind, such as event handler code, can refer to a markup element after it is constructed during processing by a XAML processor.
(Inherited from FrameworkElement)
Opacity | Gets or sets the opacity factor applied to the entire UIElement when it is rendered in the user interface (UI). This is a dependency property.
(Inherited from UIElement)
OpacityMask | Gets or sets an opacity mask, as a Brush implementation that is applied to any alpha-channel masking for the rendered content of this element. This is a dependency property.
(Inherited from UIElement)
OverridesDefaultStyle | Gets or sets a value that indicates whether this element incorporates style properties from theme styles.
(Inherited from FrameworkElement)
Padding | Gets or sets the padding inside a control.
(Inherited from Control)
Parent | Gets the logical parent element of this element.
(Inherited from FrameworkElement)
PersistId | Obsolete.
Gets a value that uniquely identifies this element.
(Inherited from UIElement)
RenderSize | Gets (or sets) the final render size of this element.
(Inherited from UIElement)
RenderTransform | Gets or sets transform information that affects the rendering position of this element. This is a dependency property.
(Inherited from UIElement)
RenderTransformOrigin | Gets or sets the center point of any possible render transform declared by RenderTransform, relative to the bounds of the element. This is a dependency property.
(Inherited from UIElement)
Resources | Gets or sets the locally-defined resource dictionary.
(Inherited from FrameworkElement)
ScrollbarVisibility |  The visibility of the preview view scrollbars.
SnapsToDevicePixels | Gets or sets a value that determines whether rendering for this element should use device-specific pixel settings during rendering. This is a dependency property.
(Inherited from UIElement)
Style | Gets or sets the style used by this element when it is rendered.
(Inherited from FrameworkElement)
TabIndex | Gets or sets a value that determines the order in which elements receive focus when the user navigates through controls by using the TAB key.
(Inherited from Control)
Tag | Gets or sets an arbitrary object value that can be used to store custom information about this element.
(Inherited from FrameworkElement)
Template | Gets or sets a control template.
(Inherited from Control)
TemplatedParent | Gets a reference to the template parent of this element. This property is not relevant if the element was not created through a template.
(Inherited from FrameworkElement)
ToolTip | Gets or sets the tool-tip object that is displayed for this element in the user interface (UI).
(Inherited from FrameworkElement)
TouchesCaptured | Gets all touch devices that are captured to this element.
(Inherited from UIElement)
TouchesCapturedWithin | Gets all touch devices that are captured to this element or any child elements in its visual tree.
(Inherited from UIElement)
TouchesDirectlyOver | Gets all touch devices that are over this element.
(Inherited from UIElement)
TouchesOver | Gets all touch devices that are over this element or any child elements in its visual tree.
(Inherited from UIElement)
Triggers | Gets the collection of triggers established directly on this element, or in child elements.
(Inherited from FrameworkElement)
Uid | Gets or sets the unique identifier (for localization) for this element. This is a dependency property.
(Inherited from UIElement)
UIView | The UI view representing the preview view.
UseLayoutRounding | Gets or sets a value that indicates whether layout rounding should be applied to this element's size and position during layout.
(Inherited from FrameworkElement)
VerticalAlignment | Gets or sets the vertical alignment characteristics applied to this element when it is composed within a parent element such as a panel or items control.
(Inherited from FrameworkElement)
VerticalContentAlignment | Gets or sets the vertical alignment of the control's content.
(Inherited from Control)
ViewId | The view Id.
Visibility | Gets or sets the user interface (UI) visibility of this element. This is a dependency property.
(Inherited from UIElement)
Width | Gets or sets the width of the element.
(Inherited from FrameworkElement)
Top
See Also
Reference
PreviewControl Class
Autodesk.Revit.UI Namespace